random/build_ideas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
          "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <title>Project Ideas for Hackbright Build Days</title>
    <!-- 2017-12-16 Sat 17:45 -->
    <meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta  name="generator" content="Org-mode" />
    <meta  name="author" content="David Lindes" />
    <link rel="custom stylesheet" type="text/css" href="http://www.daveltd.com/style/org-mode.css" />
  </head>
  <body>
    <div id="content">
      <h1 class="title">Project Ideas for Hackbright Build Days</h1>
      <div id="table-of-contents">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents">
          <ul>
            <li><a href="#sec-1">Application ideas!</a>
              <ul>
                <li><a href="#sec-1-1">JavaScript-oriented projects:</a>
                  <ul>
                    <li><a href="#sec-1-1-1">Tic Tac Toe (goal: build using React)</a></li>
                    <li><a href="#sec-1-1-2">Display data on meteors (goal: build using D3)</a></li>
                  </ul>
                </li>
                <li><a href="#sec-1-2">Backend-oriented apps</a>
                  <ul>
                    <li><a href="#sec-1-2-1">To-do list app</a></li>
                    <li><a href="#sec-1-2-2">Search for events (such as Career Fairs) on Eventbrite (goal: build using Eventbrite API)</a></li>
                    <li><a href="#sec-1-2-3">Chat application between people</a></li>
                    <li><a href="#sec-1-2-4">Chatbot</a></li>
                  </ul>
                </li>
              </ul>
            </li>
            <li><a href="#sec-2">Useful resources</a></li>
          </ul>
        </div>
      </div>
      <p>
        [Note: this document can be found online at <a href="http://bit.ly/hb-buildday-ideas">bit.ly/hb-buildday-ideas</a>.]
      </p>

      <div id="outline-container-sec-1" class="outline-2 stuff">
        <h2 id="sec-1">Application ideas!</h2>
        <div class="outline-text-2" id="text-1">
          <p>
            Here are some ideas for projects one could build, with a description
            of a basic Minimum Viable Product (MVP), plus varying components that
            would add complexity, should you wish to take this app beyond MVP status.
          </p>

          <p>
            It's totally OK to take these project ideas home with you!  Continue
            work on what you start here today, or start another one; it's up to
            you. :) And of course, you can also work on whatever projects you
            already have ideas for, even if you've already started.  It's a day to
            build, whatever and however you like, with the support of peers and
            experienced supporters to ask questions of.
          </p>

          <p>
            If you do finish an MVP and/or extra components today, <i>great</i>!  AND,
            also know that it's totally fine to need more time.  Experience shows
            that most folks do, so you won't be alone &#x2013; the few hours we have set
            aside today are not a lot of time, especially if you're trying for
            bonus components in the app you choose to build.
          </p>

          <p>
            Also, for the purposes of today's exercise, having this be a
            multi-user app (except in the case of the chat app) is considered a
            bonus, rather than part of the MVP.  The idea is to have you build
            something that does something in a way that can be used by <i>someone</i>.
            Without supporting multiple accounts, most apps won't be "viable" in a
            release-it-to-the-world way, but they sure will be for the purposes of
            a learning exercise.  That said, it's recommended that you keep in
            mind what would have to be different to make it multi-user if you
            don't start out that way.  That way, it'll be easier to transition
            later if/when you decide to.  Plus it's just a good thinking
            exercise. 😊
          </p>

          <p>
            Without further ado, here are a few app ideas, broken into categories:
          </p>
        </div>

        <div id="outline-container-sec-1-1" class="outline-3">
          <h3 id="sec-1-1">JavaScript-oriented projects:</h3>
          <div class="outline-text-3" id="text-1-1">
          </div><div id="outline-container-sec-1-1-1" class="outline-4">
            <h4 id="sec-1-1-1">Tic Tac Toe (goal: build using React)</h4>
            <div class="outline-text-4" id="text-1-1-1">
              <p>
                An app to do <a href="https://en.wikipedia.org/wiki/Tic-tac-toe">tic-tac-toe</a> in the browser.  Note that there's a tutorial
                for doing exactly this on the react web page:
                <a href="https://facebook.github.io/react/tutorial/tutorial.html">facebook.github.io/react/tutorial/tutorial.html</a>
              </p>

              <p>
                Also, you may find this <a href="https://github.com/lindes/tutorials/tree/master/vagrants#react">Vagrant mini-guide written specifically for
                  this project</a> (or even just the accompanying <a href="https://raw.githubusercontent.com/lindes/tutorials/master/vagrants/react/Vagrantfile">Vagrantfile</a>) useful to get
                the ball rolling.
              </p>
            </div>

            <div id="outline-container-sec-1-1-1-1" class="outline-5">
              <h5 id="sec-1-1-1-1">MVP requirements</h5>
              <div class="outline-text-5" id="text-1-1-1-1">
                <ul class="org-ul">
                  <li>Display a 3x3 grid, with the characteristic "#" pattern.
                  </li>
                  <li>when clicking on a square in the grid, change it to the current
                    player indicator &#x2013; either an X or an O.
                  </li>
                  <li>toggle between X and O and the next play.
                  </li>
                </ul>
              </div>
            </div>

            <div id="outline-container-sec-1-1-1-2" class="outline-5">
              <h5 id="sec-1-1-1-2">Bonus functionalities</h5>
              <div class="outline-text-5" id="text-1-1-1-2">
                <ul class="org-ul">
                  <li>have a server backend that allows two people to play against
                    each other, one getting X, and one getting O.  Keep track of
                    turns.  This could involve just sharing a special URL for the
                    game ID, or:
                  </li>
                  <li>allow some form of login (could be ephemeral, could be
                    long-lasting), and for people to start games and wait for
                    another player to join them.
                  </li>
                  <li>keep track of cumulative scores for a player (wins, losses,
                    draws)
                  </li>
                </ul>
              </div>
            </div>
          </div>

          <div id="outline-container-sec-1-1-2" class="outline-4">
            <h4 id="sec-1-1-2">Display data on meteors (goal: build using D3)</h4>
            <div class="outline-text-4" id="text-1-1-2">
              <p>
                Get data from an external source about meteors, and display a visual
                representation of them using D3
              </p>
            </div>

            <div id="outline-container-sec-1-1-2-1" class="outline-5">
              <h5 id="sec-1-1-2-1">MVP requirements</h5>
              <div class="outline-text-5" id="text-1-1-2-1">
                <ul class="org-ul">
                  <li>get the data <a href="https://data.nasa.gov/Space-Science/Meteorite-Landings/gh4g-9sfh">from NASA</a> (clicking "Export" on the top-right and
                    choosing "CSV" is recommended; you can then decide a way to
                    convert and/or import the data so the app can use it.)
                  </li>
                  <li>Make the data available &#x2013; two main options here:
                    <ul class="org-ul">
                      <li>on the backend &#x2013; create a model and import into a database
                      </li>
                      <li>on the frontend &#x2013; convert the data into JSON or similar, so
                        you can fetch it
                      </li>
                    </ul>
                  </li>
                  <li>build some sort of visualization based on this data.  Ideas for
                    starting points on this:
                    <ul class="org-ul">
                      <li>build a scatter-plot of mass over time
                      </li>
                      <li>plot the landings on a map.  (<a href="https://github.com/d3/d3-geo">d3-geo</a> may be useful here.)
                      </li>
                    </ul>
                  </li>
                </ul>
              </div>
            </div>
          </div>
        </div>

        <div id="outline-container-sec-1-2" class="outline-3">
          <h3 id="sec-1-2">Backend-oriented apps</h3>
          <div class="outline-text-3" id="text-1-2">
            <p>
              For these, you could either continue to use Flask as a starting point,
              or branch out into trying <a href="https://www.djangoproject.com/">Django</a> (a popular Python-based framework) or
              <a href="http://rubyonrails.org/">Rails</a> (another popular framework, this one <a href="https://www.ruby-lang.org/">Ruby</a>-based, thus exposing
              you to not only a new framework, but a whole new programming
              language).
            </p>
          </div>

          <div id="outline-container-sec-1-2-1" class="outline-4">
            <h4 id="sec-1-2-1">To-do list app</h4>
            <div class="outline-text-4" id="text-1-2-1">
              <p>
                An app for keeping track of things one needs to do.
              </p>
            </div>

            <div id="outline-container-sec-1-2-1-1" class="outline-5">
              <h5 id="sec-1-2-1-1">MVP requirements</h5>
              <div class="outline-text-5" id="text-1-2-1-1">
                <ul class="org-ul">
                  <li>Allow the entry of new items that might need doing.
                  </li>
                  <li>Store such items in a database, so they can be retrieved later.
                  </li>
                  <li>Present a list of stored items.
                  </li>
                  <li>Have a way to mark an item completed.
                  </li>
                  <li>When an item is marked completed, either alter the way it's
                    displayed (e.g. <del>strikethrough</del>), or simply remove it.
                  </li>
                </ul>
              </div>
            </div>

            <div id="outline-container-sec-1-2-1-2" class="outline-5">
              <h5 id="sec-1-2-1-2">Bonus functionalities</h5>
              <div class="outline-text-5" id="text-1-2-1-2">
                <p>
                  Feel free to add any one or as many as you like of the following:
                </p>

                <ul class="org-ul">
                  <li>Provide a way to delete an item, instead of just completing it.
                  </li>
                  <li>Allow a user to edit the description of an item.
                  </li>
                  <li>Have accounts and login/logout, with items stored privately for each user.
                  </li>
                  <li>slick AJAX-y interface, where items perhaps gradually fade from
                    screen, or get moved to a different part of the page showing
                    recently-completed items, or such.
                  </li>
                  <li>an "undo" for completions or deletions.
                  </li>
                  <li>due-dates for items
                  </li>
                  <li>contexts for items (e.g. one item is something to buy at a grocery
                    store, and you'd only see it when looking at a grocery list; another
                    item is a phone call you need to make; and another is something you
                    have to do at home.)
                  </li>
                </ul>
              </div>
            </div>
          </div>

          <div id="outline-container-sec-1-2-2" class="outline-4">
            <h4 id="sec-1-2-2">Search for events (such as Career Fairs) on Eventbrite (goal: build using Eventbrite API)</h4>
            <div class="outline-text-4" id="text-1-2-2">
              <p>
                Something to look through Eventbrite events, and search for certain
                kinds of events.
              </p>
            </div>

            <div id="outline-container-sec-1-2-2-1" class="outline-5">
              <h5 id="sec-1-2-2-1">MVP requirements</h5>
              <div class="outline-text-5" id="text-1-2-2-1">
                <ul class="org-ul">
                  <li>connect with the <a href="http://developer.eventbrite.com">Eventbrite API</a>
                  </li>
                  <li>get a list of events
                  </li>
                  <li>filter either or both of:
                    <ul class="org-ul">
                      <li>at the API level (e.g. using categories, keyword search, and/or
                        location searches)
                      </li>
                      <li>within the app you're building (further filtering based on
                        some criteria you might have that the API doesn't fully
                        accommodate, or if you want to allow the user to dynamically
                        alter their search without making an API call each time.)
                      </li>
                    </ul>
                  </li>
                </ul>
              </div>
            </div>

            <div id="outline-container-sec-1-2-2-2" class="outline-5">
              <h5 id="sec-1-2-2-2">Bonus requirements</h5>
              <div class="outline-text-5" id="text-1-2-2-2">
                <ul class="org-ul">
                  <li>Allow a user to either select or dismiss events &#x2013; selected
                    events showing up in a list of things they want to go to,
                    dismissed events disappearing from the display, even if a new
                    search is done.
                  </li>
                </ul>
              </div>
            </div>
          </div>

          <div id="outline-container-sec-1-2-3" class="outline-4">
            <h4 id="sec-1-2-3">Chat application between people</h4>
            <div class="outline-text-4" id="text-1-2-3">
              <p>
                Allow people to chat via their browsers.
              </p>
            </div>

            <div id="outline-container-sec-1-2-3-1" class="outline-5">
              <h5 id="sec-1-2-3-1">MVP requirements</h5>
              <div class="outline-text-5" id="text-1-2-3-1">
                <ul class="org-ul">
                  <li>Allow at least two people to connect to the website, with at
                    least a minimal login (could just be ephemeral &#x2013; e.g. "Enter
                    your name").
                  </li>
                  <li>Have a way for two users to connect to each other (could be
                    listing online users, could be a URL to share offline, etc.)
                  </li>
                  <li>Once chatting, send messages from one user to the other in a
                    timely (say, less than a second) manner, in both directions.
                  </li>
                </ul>
              </div>
            </div>

            <div id="outline-container-sec-1-2-3-2" class="outline-5">
              <h5 id="sec-1-2-3-2">Bonus functionalities</h5>
              <div class="outline-text-5" id="text-1-2-3-2">
                <ul class="org-ul">
                  <li>Make timestamps available, and/or shown by default in a
                    "non-spammy" sort of way.
                  </li>
                  <li>OAuth-based login against one or more existing providers
                    (Google, twitter, facebook, etc.)
                  </li>
                  <li>Store chat history, allow displaying and/or searching of it.
                  </li>
                </ul>
              </div>
            </div>
          </div>

          <div id="outline-container-sec-1-2-4" class="outline-4">
            <h4 id="sec-1-2-4">Chatbot</h4>
            <div class="outline-text-4" id="text-1-2-4">
              <p>
                Create a "<a href="https://en.wikipedia.org/wiki/Internet_bot">bot</a>" that will connect to an existing chat service
                (e.g. using the <a href="https://api.slack.com/">Slack API</a>), and interact with messages on that
                channel.
              </p>
            </div>

            <div id="outline-container-sec-1-2-4-1" class="outline-5">
              <h5 id="sec-1-2-4-1">MVP requirements</h5>
              <div class="outline-text-5" id="text-1-2-4-1">
                <ul class="org-ul">
                  <li>Connect to an appropriate chat service
                  </li>
                  <li>Respond to "direct messages" / "mentions" in some manner
                  </li>
                  <li>Have some set of "commands" that, if presented after the
                    mention, will cause the bot to insert certain (possibly
                    dynamic) responses.
                  </li>
                </ul>
              </div>
            </div>

            <div id="outline-container-sec-1-2-4-2" class="outline-5">
              <h5 id="sec-1-2-4-2">Bonus functionalities</h5>
              <div class="outline-text-5" id="text-1-2-4-2">
                <ul class="org-ul">
                  <li>Have a set of things that the bot will look for in messages
                    that <i>do not</i> mention the bot, to which the bot will respond
                    anyway.  For example:
                    <ul class="org-ul">
                      <li>If it sees the word "weather" in a message that ends with a
                        question mark, it looks up the current weather and reports
                        that to the channel.  Double-bonus: if a location is also
                        mentioned, it looks up weather in that particular place.
                      </li>
                      <li>If it sees an expression of dismay ("this sucks", ":(",
                        etc.), it responds with an affirmation and/or validation of
                        some kind.
                      </li>
                    </ul>
                  </li>
                </ul>
              </div>
            </div>
          </div>
        </div>
      </div>

      <div id="outline-container-sec-2" class="outline-2">
        <h2 id="sec-2">Useful resources</h2>
        <div class="outline-text-2" id="text-2">
          <p>
            I've created some resources for using <a href="https://vagrantup.com/">Vagrant</a> to help get projects
            started more easily.
          </p>
        </div>
      </div>
    </div>
  </body>
</html>
